In [2]:
import sqlite3
import pandas as pd

In [3]:
conn = sqlite3.connect('project3.sqlite')

In [4]:
df = pd.read_csv("Resources/tmdb_5000_movies_updated.csv")
df.head(2)

,budget,genres,id,production_countries,release_date,revenue,runtime,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",19995,"[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,Avatar,7.2,11800
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",285,"[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-19,961000000,169.0,Pirates of the Caribbean: At World's End,6.9,4500

In [6]:
df1 = df.loc[:,["title", "release_date", "budget", "revenue", "vote_average"]]

In [7]:
df1.to_sql(name='movies', con=conn, if_exists='replace', index=False)

4803

In [8]:
df1.dtypes

title            object
release_date     object
budget            int64
revenue           int64
vote_average    float64
dtype: object

In [12]:
df2 = pd.read_sql("select * from movies where vote_average > 5.0", con=conn)
df2

,title,release_date,budget,revenue,vote_average
0,Avatar,2009-12-10,237000000,2787965087,7.2
1,Pirates of the Caribbean: At World's End,2007-05-19,300000000,961000000,6.9
2,Spectre,2015-10-26,245000000,880674609,6.3
3,The Dark Knight Rises,2012-07-16,250000000,1084939099,7.6
4,John Carter,2012-03-07,260000000,284139100,6.1
...,...,...,...,...,...
4184,El Mariachi,1992-09-04,220000,2040920,6.6
4185,Newlyweds,2011-12-26,9000,0,5.9
4186,"Signed, Sealed, Delivered",2013-10-13,0,0,7.0
4187,Shanghai Calling,2012-05-03,0,0,5.7
4188,My Date with Drew,2005-08-05,0,0,6.3